Dlubal.SteelSurfaces.ThicknessType
Thickness type of surface

Dlubal.SteelSurfaces.ThicknessType.ThicknessConstant
Thickness constant

Dlubal.SteelSurfaces.ThicknessType.ThicknessLinear
Thickness linear

Dlubal.SteelSurfaces.ThicknessType.ThicnessCoupling
Thickness coupling

Dlubal.SteelSurfaces.ThicknessType.ThicknessRigid
Thickness rigid

Dlubal.SteelSurfaces.ThicknessType.ThicknessOrthotrop
Thickness orthotrop

Dlubal.SteelSurfaces.ThicknessType.ThicknessNull
Thickness null